{
  "Browse": "التصفح",
  "Insights": "التحليل",
  "Tracker": "التقدم",
  "Light Mode": "الوضع الفاتح",
  "Dark Mode": "الوضع الداكن",
  "Save Links": "حفظ الروابط",
  "Key Shortcuts": "الاختصارات",
  "Delete all key shortcuts": "حذف كل الاختصارات",
  "All shortcuts will be permanently deleted and cannot be restored. Are you sure you want to continue?": "سيتم حذف جميع الاختصارات بشكل نهائي، ولن تتمكن من استعادتها لاحقًا. هل أنت متأكد من المتابعة؟",
  "Paste your YouTube playlist link": "ألصق رابط قائمة التشغيل على يوتيوب",
  "Playlist Link": "رابط قائمة التشغيل",
  "Close Drawer": "إغلاق القائمة الجانبية",
  "Open Drawer": "فتح القائمة الجانبية",
  "Delete all shortcuts?": "هل تريد حذف كل الاختصارات؟",
  "Yes, delete all": "نعم، احذف الكل",
  "Edit saved link": "تعديل الرابط المحفوظ",
  "Title": "العنوان",
  "Link": "الرابط",
  "Save changes": "حفظ التعديلات",
  "Delete saved link?": "حذف الرابط المحفوظ؟",
  "This link will be permanently deleted and cannot be restored. Are you sure you want to continue?": "سيتم حذف هذا الرابط نهائيًا ولن تتمكن من استعادته لاحقًا. هل أنت متأكد من المتابعة؟",
  "Yes, delete link": "نعم، احذف الرابط",
  "Cancel": "إلغاء",
  "Paste": "لصق",
  "Paste the last copied text": "لصق آخر نص تم نسخه",
  "Total Video Duration": "إجمالي مدة الفيديوهات",
  "Total Videos": "عدد الفيديوهات",
  "Video Number": "الفيديو رقم",
  "From": "من",
  "Steps are enough to get control over any playlist.": "خطوات تمنحك السيطرة على أي قائمة تشغيل.",
  "Search for any YouTube playlist effortlessly and access its details instantly. Enable automatic saving to store important playlist links with a single click, or turn it off anytime you want. All saved links are organized in one place for easy access. A smart paste shortcut also lets you insert the last copied text directly into the search field, saving you time and speeding up your workflow.": "ابحث عن أي قائمة تشغيل على يوتيوب بسهولة واطلع على تفاصيلها فورًا. فعّل خاصية الحفظ التلقائي لتخزين روابط قوائم التشغيل المهمة بنقرة واحدة، أو أوقفها متى شئت. جميع الروابط المحفوظة مُنظمة في مكان واحد لسهولة الوصول إليها. كما يتيح لك اختصار اللصق الذكي إدراج النص الأخير المنسوخ مباشرةً في حقل البحث، مما يوفر لك الوقت ويسرّع سير عملك.",
  "The Insights section provides a comprehensive view of all essential playlist details in a beautifully organized layout. From basic information like the playlist name and channel to detailed metrics such as total duration and last update, everything is displayed clearly and accessibly. The section intelligently adapts to content language, automatically switching text direction and fonts for Arabic content while maintaining a clean, professional appearance in both light and dark modes.": "يُقدّم قسم التحليل عرضًا شاملاً لجميع تفاصيل قوائم التشغيل الأساسية بتصميم أنيق ومنظم. بدءًا من المعلومات الأساسية كاسم قائمة التشغيل والقناة، وصولًا إلى المقاييس التفصيلية كالمدة الإجمالية وتاريخ آخر تحديث، يُعرض كل شيء بوضوح وسهولة. يتكيف القسم بذكاء مع لغة المحتوى، حيث يُغيّر اتجاه النص ونوعه تلقائيًا للمحتوى العربي، مع الحفاظ على مظهر أنيق واحترافي في الوضعين الفاتح والداكن.",
  "The Track section helps you monitor any playlist accurately and effortlessly. Simply enter how many videos you've completed to see your progress in terms of completion percentage, watched time, and remaining videos. The section calculates the remaining time needed to finish the playlist and provides detailed statistics on both video count and duration. You can also set how many videos you watch per day to see exactly when you'll complete the playlist, making time management and progress tracking clear, effective, and motivating.": "يساعدك قسم التقدم على مراقبة أي قائمة تشغيل بدقة وسهولة. ما عليك سوى إدخال عدد الفيديوهات التي شاهدتها حتى الآن لمعرفة مدى تقدمك من حيث نسبة الإنجاز، ووقت المشاهدة، والفيديوهات المتبقية. يحسب هذا القسم الوقت المتبقي لإنهاء قائمة التشغيل، ويقدم إحصائيات مفصلة حول عدد الفيديوهات ومدتها. يمكنك أيضًا تحديد عدد الفيديوهات التي تشاهدها يوميًا لمعرفة الوقت الذي ستنهي فيه قائمة التشغيل بالضبط، مما يجعل إدارة الوقت وتتبع التقدم واضحًا وفعالًا ومحفزًا.",
  "Discover more": "اكتشف المزيد",
  "Calculate": "احسب",
  "Developed by": "تم التطوير بواسطة",
  "Mahmoud Badr": "محمود بدر",
  "Home": "الرئيسية",
  "All Rights Reserved.": ".جميع الحقوق محفوظة",
  "Your smart YouTube playlist companion. Instantly browse playlists, explore detailed insights, track your progress, and predict completion dates. Save favorites, manage your learning journey, and stay organized—all in one powerful, bilingual tool.": "رفيقك الذكي لقوائم تشغيل يوتيوب. تصفح القوائم فورًا، استكشف رؤى تفصيلية، تتبع تقدمك، وتنبأ بتواريخ الإنهاء. احفظ المفضلات، أدر رحلة التعلم، وابقَ منظمًا—كل ذلك في أداة واحدة قوية وثنائية اللغة.",
  "Playlist Name": "اسم قائمة التشغيل",
  "Channel Name": "اسم القناة",
  "Playlist Description": "وصف قائمة التشغيل",
  "Day / Month / Year": "اليوم / الشهر / السنة",
  "Average video duration": "متوسط مدة الفيديو",
  "Privacy Status": "حالة الخصوصية",
  "Published At": "تاريخ النشر",
  "public": "عام",
  "private": "خاص",
  "unlisted": "غير مدرج",
  "unknown": "مجهول",
  "Playlist Thumbnail": "صورة مصغرة لقائمة التشغيل",
  "Last Update": "آخر تحديث",
  "Invalid Value": "قيمة غير صحيحة",
  "This is not a valid link, not a YouTube playlist, or not even a link at all.": "هذا ليس رابطًا صحيحًا، ولا قائمة تشغيل على يوتيوب، ولا حتى رابط.",
  "Got it": "حسنًا",
  "Please search for a playlist first": "من فضلك ابحث عن قائمة تشغيل أولاً",
  "Enter a YouTube playlist link above": "أدخل رابط قائمة التشغيل في الأعلى",
  "Failed to load playlist": "فشل تحميل قائمة التشغيل",
  "Failed to fetch the list of videos": "فشل في جلب قائمة الفيديوهات",
  "Failed to retrieve playlist information": "فشل في استرداد معلومات قائمة التشغيل",
  "Failed to retrieve video details": "فشل في استرداد تفاصيل الفيديو",
  "Invalid playlist link": "رابط قائمة تشغيل غير صالح",
  "Please try again": "يرجى المحاولة مرة أخرى",
  "No playlist data found": "لم يتم العثور على بيانات قائمة التشغيل",
  "An error occurred": "حدث خطأ",
  "All shortcuts deleted successfully": "تم حذف جميع الاختصارات بنجاح",
  "Changes saved successfully": "تم حفظ التغييرات بنجاح",
  "Link deleted successfully": "تم حذف الرابط بنجاح",
  "Discover": "اكتشف",
  "Video Completion Percentage": "نسبة إكمال الفيديوهات",
  "Watched Time Percentage": "نسبة وقت المشاهدة",
  "Videos completed": "الفيديوهات المكتملة",
  "Videos remaining": "الفيديوهات المتبقية",
  "Watched time": "وقت المشاهدة",
  "Remaining time": "الوقت المتبقي",
  "This is a playlist of": "هذه قائمة تشغيل من",
  "videos,": "فيديو،",
  "How many videos have you finished from the beginning of the list?": "كم عدد الفيديوهات التي أنهيتها من بداية القائمة؟",
  "Completed videos": "الفيديوهات المكتملة",
  "How many videos do you watch per day?": "كم فيديو تشاهد يوميًا؟",
  "You'll finish the remaining videos in": "ستنهي الفيديوهات المتبقية في",
  "day": "يوم",
  "days": "أيام",
  "Videos you watch per day": "عدد الفيديوهات التي تشاهدها يومياً",
  "Daily watching time": "وقت المشاهدة اليومي",
  "How long do you spend watching videos per day?": "كم من الوقت تقضيه في مشاهدة الفيديوهات يومياً؟",
  "Link saved successfully": "تم حفظ الرابط بنجاح",
  "Clipboard access denied": "تم رفض الوصول إلى الحافظة",
  "Too short playlist": "قائمة التشغيل قصيرة جدًا",
  "The tracker is designed for playlists with more than 2 videos, to help you monitor progress, completion, and time spent.": "تم تصميم أداة التتبع لقوائم التشغيل التي تحتوي على أكثر من مقطعي فيديو، لمساعدتك على مراقبة التقدم والإكمال والوقت المستغرق.",
  "h = hours, m = minutes, s = seconds": "h = ساعات، m = دقائق، s = ثواني",
  "Search smarter, understand deeper, and track your progress with total clarity.": "ابحث بذكاء، وافهم بعمق، وتتبع تقدمك بوضوح تام.",
  "Track": "تتبع"
}
